## JOIN Processes

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///learnsql.db

In [3]:
%%sql 
SELECT name FROM  sqlite_master WHERE type = "table";

 * sqlite:///learnsql.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',),
 ('new_table',)]

In [4]:
%%sql
SELECT * FROM Categories LIMIT 4;

 * sqlite:///learnsql.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses')]

In [5]:
%%sql
SELECT * FROM Products LIMIT 4;

 * sqlite:///learnsql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)]

## left join

In [7]:
%%sql
SELECT * FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

In [11]:
%%sql
SELECT Products.ProductName,Categories.CategoryID,Categories.CategoryName FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

In [14]:
%%sql
SELECT PR.ProductName,CA.CategoryID,CA.CategoryName FROM Products AS PR LEFT OUTER JOIN Categories AS CA ON PR.CategoryID = CA.CategoryID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

In [16]:
%%sql
SELECT PR.ProductName,CA.CategoryID,CA.CategoryName FROM Products PR LEFT OUTER JOIN Categories CA ON PR.CategoryID = CA.CategoryID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments')]

In [17]:
%%sql 
SELECT * FROM Orders LIMIT 2;

 * sqlite:///learnsql.db
Done.

[(10248, 90, 5, '4.07.1996', 3), (10249, 81, 6, '5.07.1996', 1)]

In [19]:
%%sql
SELECT * FROM OrderDetails LIMIT 2;

 * sqlite:///learnsql.db
Done.

[(1, 10248, 11, 12), (2, 10248, 42, 10)]

In [23]:
%%sql
SELECT ORA.CustomerID,ORD.ProductID,ORA.OrderDate,ORA.OrderID FROM Orders ORA LEFT OUTER JOIN OrderDetails ORD ON ORA.OrderID = ORD.OrderID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[(90, 11, '4.07.1996', 10248),
 (90, 42, '4.07.1996', 10248),
 (90, 72, '4.07.1996', 10248),
 (81, 14, '5.07.1996', 10249),
 (81, 51, '5.07.1996', 10249)]

## Inner JOIN

In [24]:
%%sql
SELECT * FROM Customers LIMIT 3;

 * sqlite:///learnsql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

In [25]:
%%sql
SELECT * FROM Orders LIMIT 3;

 * sqlite:///learnsql.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

In [26]:
%%sql
SELECT ORA.OrderID,CUS.CustomerID FROM Orders ORA INNER JOIN Customers CUS ON ORA.CustomerID = CUS.CustomerID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[(10248, 90), (10249, 81), (10250, 34), (10251, 84), (10252, 76)]

In [28]:
%%sql
SELECT COUNT(*) FROM (SELECT ORA.OrderID,CUS.CustomerID FROM Orders ORA INNER JOIN Customers CUS ON ORA.CustomerID = CUS.CustomerID);

 * sqlite:///learnsql.db
Done.

[(196,)]

In [29]:
%%sql
SELECT ORA.OrderID,CUS.CustomerName FROM Orders ORA INNER JOIN Customers CUS ON ORA.CustomerID = CUS.CustomerID LIMIT 5;

 * sqlite:///learnsql.db
Done.

[(10248, 'Wilman Kala'),
 (10249, 'Tradição Hipermercados'),
 (10250, 'Hanari Carnes'),
 (10251, 'Victuailles en stock'),
 (10252, 'Suprêmes délices')]